etc/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="notice" version="1.0">

   <clients>
      <client host="[client]" cpu="1" maxusers="63000" />
	  ...
   </clients>

  <servers>
    <server host="[server]" port="10001" type="tcp" />
  </servers>

  <load>
    <arrivalphase phase="1" duration="99999" unit="second">
      <users maxnumber="10000" arrivalrate="1000" unit="second" />
    </arrivalphase>
  </load>

  <options>
	<option name="ports_range" min="1025" max="65535"/>
	<option name="max_retries" value="0" />
	
	<option name="connect_timeout" value="20000" />
  </options>
  
  <sessions>
    <session name="test" probability="100" type="ts_http">
        <for from="1" to="50" incr="1" var="reqNo">
			<request subst="true">
				<http url="/test/process" method="POST" version="1.1" contents='{&quot;name&quot;: &quot;test&quot;'>
					<http_header name="Content-Type" value="application/json"/>
				</http>
			</request>
        </for>
    </session>
  </sessions>
</tsung>